In [1]:
import pandas as pd

In [2]:
cd /Users/ryanmorales/desktop

/Users/ryanmorales/Desktop

In [12]:
cities = pd.read_csv("TopCities.csv")

I've imported my CSV file and read it through python

In [14]:
cities.head()

              City    Country  Population
0        São Paulo     Brazil  10,009,000
1           Bombay      India   9,925,000
2          JAKARTA  Indonesia   9,373,000
3          Karachi   Pakistan   9,339,000
4  MOSKVA (Moscow)     Russia   8,297,000

in this example of tidying up my data, I will use the sort tool to sort my list by city name

In [16]:
cities.sort_values('City')

           City        Country Population
67  ADDIS ABABA        Ethopia  2,424,000
46       ANKARA         Turkey  2,984,000
93      Abidjan  Côte d’Ivorie  1,929,000
49    Ahmedabad          India  2,954,000
39   Alexandria          Egypt  3,339,000
..          ...            ...        ...
28        Wuhan          China  4,040,000
52         Xian          China  2,872,000
62       YANGON        Myanmar  2,513,000
36     Yokohama          Japan  3,426,000
64         Zibo          China  2,484,000

[99 rows x 3 columns]